## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.main[0] will be created
  + resource "cloudflare_record" "main" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "demo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = (known after apply)
      + zone_id         = "dd7fe0d34b8046c8ae8afd3223510508"
    }

  # cloudflare_record.main[1] will be created
  + resource "cloudflare_record" "main" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "demo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = (known after apply)
      + zone_id         = "dd7fe0d34b8046c8ae8afd3223510508"
    }

  # cloudflare_record.main[2] will be created
  + resource "cloudflare_record" "main" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "demo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = (known after apply)
      + zone_id         = "dd7fe0d34b8046c8ae8afd3223510508"
    }

  # cloudflare_record.main[3] will be created
  + resource "cloudflare_record" "main" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "demo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = (known after apply)
      + zone_id         = "dd7fe0d34b8046c8ae8afd3223510508"
    }

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "demo.jumisa.io"
      + domain_validation_options = [
          + {
              + domain_name           = "*.demo.jumisa.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "demo.jumisa.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.demo.jumisa.io",
          + "demo.jumisa.io",
        ]
      + tags                      = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "demo.jumisa.io"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                  = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "demo.jumisa.io"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for eks-demo"
      + id                      = (known after apply)
      + name                    = "eks-demo"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                  = (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-default"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-default"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-default"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-default"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-default"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-default"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all             = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-private"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all         = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-private"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-public"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all         = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-public"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-db-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                                       = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-db-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.130.0/23"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-db-us-east-1b"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                                       = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-db-us-east-1b"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-private-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                                       = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-private-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/22"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-private-us-east-1b"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                                       = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-private-us-east-1b"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-public-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                                       = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-public-us-east-1a"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.40.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-public-us-east-1b"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                                       = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo-public-us-east-1b"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all                             = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "eks-demo"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
    }

  # module.zones.aws_route53_zone.this["demo.jumisa.io"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "demo.jumisa.io (demo)"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "demo.jumisa.io"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + tags_all            = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Prabhu"
          + "Product"   = "Jumisa Demo Project"
          + "Team"      = "DevOps"
        }
      + zone_id             = (known after apply)
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + count_ns                  = (known after apply)
  + route53_zone_name         = "demo.jumisa.io"
  + route53_zone_name_servers = (known after apply)
  + zero_th                   = (known after apply)
```
</details>